#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

//
//int main()
//{
//	int a = 10;
//	a = a << 1;//a <<= 1;
//	//int b = a << 1;
//	//10
//	//00000000000000000000000000001010
//	//
//	//printf("b = %d\n", b);
//	printf("a = %d\n", a);
//
//	return 0;
//}
//


//int main()
//{
//	int a = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	// 
//	//11111111111111111111111111111110
//	//10000000000000000000000000000001
//	//10000000000000000000000000000010
//	int b = a << 1;
//
//	printf("b=%d\n", b);//-2
//	printf("a=%d\n", a);//-1
//
//	return 0;
//}

//int main()
//{
//	int a = -10;
//	//10000000000000000000000000001010
//	//11111111111111111111111111110101
//	//11111111111111111111111111110110 -- 补码
//	//
//	int b = a >> 1;//算术右移
//	//11111111111111111111111111111011
//	//10000000000000000000000000000100
//	//10000000000000000000000000000101
//	//
//	printf("a=%d\n", a);//-10
//	printf("b=%d\n", b);//-5
//
//	return 0;
//}

//int main()
//{
//	int a = 6;
//	//00000000000000000000000000000110 - 6的补码
//	//
//	int b = -7;
//	//10000000000000000000000000000111
//	//11111111111111111111111111111000
//	//11111111111111111111111111111001 -> -7的补码
//
//
//	int c = a & b;//a和b的补码的二进制位进行运算
//	//对应的二进制位，有0则为0，两个同时为1，才为1
//	// 
//	//00000000000000000000000000000110 - 6的补码
//	//11111111111111111111111111111001 -> -7的补码
//	//00000000000000000000000000000000
//	printf("%d\n", c);
//
//	return 0;
//}

//int main()
//{
//	int a = 6;
//	//00000000000000000000000000000110 - 6的补码
//	//
//	int b = -7;
//	//10000000000000000000000000000111
//	//11111111111111111111111111111000
//	//11111111111111111111111111111001 -> -7的补码
//
//	int c = a | b;//按位或：a和b的补码的二进制位进行运算
//	//规则：只要有1,就是1，两个同时为0，才为0
//	// 
//	//00000000000000000000000000000110 - 6的补码
//	//11111111111111111111111111111001 -> -7的补码
//	//11111111111111111111111111111111
//	//10000000000000000000000000000000
//	//10000000000000000000000000000001  原码
//	//
//	printf("%d\n", c);//-1
//
//	return 0;
//}
//
//int main()
//{
//	int a = 6;
//	//00000000000000000000000000000110 - 6的补码
//	//
//	int b = -7;
//	//10000000000000000000000000000111
//	//11111111111111111111111111111000
//	//11111111111111111111111111111001 -> -7的补码
//
//	int c = a ^ b;//按位异或：a和b的补码的二进制位进行运算
//	//规则：对应的二进制位，相同为0，相异为1
//	// 
//	//00000000000000000000000000000110 - 6的补码
//	//11111111111111111111111111111001 -> -7的补码
//	//11111111111111111111111111111111
//	//10000000000000000000000000000000
//	//10000000000000000000000000000001  原码
//	
//	printf("%d\n", c);//-1
//
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	printf("%d\n", ~a);
//	//~  按(2进制)位取反
//	//00000000000000000000000000000000 -- 0的补码
//	//11111111111111111111111111111111
//	//10000000000000000000000000000000
//	//10000000000000000000000000000001 原码
//
//	return 0;
//}

//不能创建临时变量（第三个变量），实现两个整数的交换。


//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	int c = 0;//空瓶
//
//	printf("交换前:a=%d b=%d\n", a, b);
//	c = a;
//	a = b;
//	b = c;
//	printf("交换后:a=%d b=%d\n", a, b);
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//
//
//	printf("交换前:a=%d b=%d\n", a, b);
//
//	a = a + b;
//	b = a - b;
//	a = a - b;
//
//	printf("交换后:a=%d b=%d\n", a, b);
//
//	return 0;
//}
//


//int main()
//{
//	int a = 3;
//	int b = 5;
//
//
//	printf("交换前:a=%d b=%d\n", a, b);
//
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//
//	printf("交换后:a=%d b=%d\n", a, b);
//
//	return 0;
//}
//
//

//int count_bit_one(unsigned int n)
//{
//	int count = 0;
//	while (n)
//	{
//		if ((n % 2) == 1)
//			count++;
//
//		n = n / 2;
//	}
//
//	return count;
//}
//00000000000000000000000000001111
//10000000000000000000000000000001
//11111111111111111111111111111110
//11111111111111111111111111111111

//int count_bit_one(int n)
//{
//	int i = 0;
//	int count = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (((n >> i) & 1) == 1)
//		{
//			count++;
//		}
//	}
//	return count;
//}


//int count_bit_one(int n)
//{
//	int i = 0;
//	int count = 0;
//	
//	while (n)
//	{
//		n = n & (n - 1);
//		count++;
//	}
//
//	return count;
//}
//
//int main()
//{
//	int num = 0;
//	scanf("%d", &num);//-1
//	int ret = count_bit_one(num);
//	printf("%d\n", ret);
//
//	return 0;
//}


//编写代码将13二进制序列的第5位修改为1，然后再改回0
//                      n
//

//int main()
//{
//	int a = 13;
//	//00000000000000000000000000001101
//	//00000000000000000000000000010000
//    //00000000000000000000000000000001
//	// 
//	//00000000000000000000000000011101
//	//11111111111111111111111111101111
//	//
//	//00000000000000000000000000000001
//	int n = 5;
//	a = a | (1 << (n - 1));
//	printf("%d\n", a);
//
//	a &= ~(a << (n - 1));
//	printf("%d\n", a);
//
//	return 0;
//}


//int main()
//{
//	int a = 1;
//	int b = 2;
//	int c = (a > b, a = b + 10, a, b = a + 1);//逗号表达式
//
//	printf("%d\n", c);
//
//	return 0;
//}


//int main()
//{
//	//代码2
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//
//	if (a = b + 1, c = a / 2, d > 0)
//	{
//
//	}
//
//	return 0;
//}


//int main()
//{
//    //a = get_val();
//    //count_val(a);
//    //while (a > 0)
//    //{
//    //    //业务处理
//    //    //...
//    //    a = get_val();
//    //    count_val(a);
//    //}
//
//
//    while (a = get_val(), count_val(a), a > 0)
//    {
//        //业务处理
//    }
//
//	return 0;
//}
//




//int main()
//{
//	int arr[10] = { 1,2,3,4,5 };
//
//	int m = arr[4];//数组中下标是4的元素
//	//[] 下标引用操作符 - 操作数是：arr,4
//	//3+5, + 是操作符，3和5是操作数
//	//
//	printf("%d\n", m);
//
//	return 0;
//}

//int Add(int x, int y)
//{
//	return x + y;
//}
//
//int main()
//{
//	printf("hehe\n");//() 就是函数调用操作符,操作数是：
//	printf("%d\n", 100);
//	int ret = Add(3, 5);//Add 3 5 
//	//函数调用操作符最少有几个操作数？
//
//	return 0;
//}
//
////学生类型
//struct Student
//{
//	//成员变量
//	char name[20];
//	int age;
//	float score;
//}s4, s5, s6;//全局变量
//
//struct Student s3 = {"王五", 25, 88.8};//全局变量
//
//struct Point
//{
//	int x;
//	int y;
//};
//
//struct S
//{
//	char ch;
//	struct Point p;
//	int arr[10];
//	double d;
//};
//
//int main()
//{
//	int a;
//
//	struct Student s1 = {"翠花", 20, 98.0};//局部变量
//	struct Student s2 = {"旺财", 18, 69.8};
//	struct Point p = { 10, 20 };
//	struct S s = { 'a',{4,5}, {1,2,3,4,5,6,7},3.14 };
//
//	printf("%c\n", s.ch);
//	printf("坐标是:%d %d\n", s.p.x, s.p.y);
//	printf("%d\n", s.arr[0]);
//	printf("%lf\n", s.d);
//
//	//结构体变量.结构体成员名
//	//-> 这个是依赖指针的，所以放在后期给大家介绍
//
//	return 0;
//}
//

//
//相邻的操作符，优先级高的先执行
//相邻的操作符的优先级相同的情况下，结合性说了算
//
int main()
{
	//int r = (3 + 4) * 5;
	int r = 3 + 4 + 5;

	return 0;
}